{
  "dialogue": [
    {
      "character": "character1",
      "text": "Yo bestie, Java OOP is absolutely sending me! There are four sigma principles that are straight fire: Encapsulation, Inheritance, Polymorphism, and Abstraction!"
    },
    {
      "character": "character2", 
      "text": "Bruh, that sounds like Ohio nonsense! What's all this encap-whatever? Are you just making up words to sound smart or what?"
    },
    {
      "character": "character1",
      "text": "Nah fam, Encapsulation is like keeping your variables on private mode! You hide the data and only let methods access it. It's giving main character energy for data protection!"
    },
    {
      "character": "character2",
      "text": "That's actually lowkey genius! So it's like having a security system for your code? What about this inheritance thing that sounds sus?"
    },
    {
      "character": "character1", 
      "text": "Inheritance is when child classes yeet all the properties from parent classes! It's like getting all your parent's rizz without the work. Pure alpha move for code reuse!"
    },
    {
      "character": "character2",
      "text": "This is absolutely bussin! So classes can inherit powers like some anime protagonist? And what's polymorphism - sounds like it's trying too hard to be different!"
    },
    {
      "character": "character1",
      "text": "Polymorphism means one method can have different behaviors depending on the object! Same name, different vibes. It's giving shape-shifter energy, totally not NPC behavior!"
    },
    {
      "character": "character2",
      "text": "My brain is literally exploding! And abstraction? Let me guess, it's about hiding complex stuff and keeping things simple for the users?"
    },
    {
      "character": "character1",
      "text": "EXACTLY! Abstraction is like showing only the sigma features while hiding all the cringe implementation details. It's the GOAT principle for clean code architecture!"
    },
    {
      "character": "character2",
      "text": "Java OOP is actually fire! These four principles are like the ultimate cheat codes for building scalable applications. I'm definitely not sleeping on Java anymore!"
    }
  ]
}